In [1]:
import numpy as np
import pandas as pd

## Creating Dataframe

In [2]:
data = {
    'Name' : ['john', 'anna', 'peter', 'linda'],
    'Age' : [28,34,29,20],
    'City' : ['new york', 'paris', 'berlin', 'london'],
    'Salary' : [65000, 70000, 62000, 85000]
}

In [3]:
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   john   28  new york   65000
1   anna   34     paris   70000
2  peter   29    berlin   62000
3  linda   20    london   85000

In [4]:
data_list = [
    [ 'john', 28, 'new york', 65000],
    [ 'anna',34, 'paris', 70000],
    [ 'peter',29, 'berlin', 62000], 
    [ 'linda', 20, 'london', 85000]
]

df2 = pd.DataFrame(data_list, columns=['Name', 'Age', 'City','Salary'])

In [5]:
df2

    Name  Age      City  Salary
0   john   28  new york   65000
1   anna   34     paris   70000
2  peter   29    berlin   62000
3  linda   20    london   85000

## Selection and indexing of column

In [6]:
df[['Name', 'City']]

    Name      City
0   john  new york
1   anna     paris
2  peter    berlin
3  linda    london

## Creating a new column

In [7]:
df['Designation'] = ['Doctor','Engineer','IAS', 'Headmaster']

In [8]:
df

    Name  Age      City  Salary Designation
0   john   28  new york   65000      Doctor
1   anna   34     paris   70000    Engineer
2  peter   29    berlin   62000         IAS
3  linda   20    london   85000  Headmaster

## Removing a column

In [9]:
df.drop('Designation',axis= 1, inplace=True)

In [10]:
df

    Name  Age      City  Salary
0   john   28  new york   65000
1   anna   34     paris   70000
2  peter   29    berlin   62000
3  linda   20    london   85000

## Selecting rows

In [11]:
df.loc[1]

Name       anna
Age          34
City      paris
Salary    70000
Name: 1, dtype: object

## Selecting subsets of rows and column

In [12]:
df.loc[[0,1]][['City', 'Salary']]

       City  Salary
0  new york   65000
1     paris   70000

In [13]:
df.loc[[2,3]][['Name', 'Age']]

    Name  Age
2  peter   29
3  linda   20

### Conditional Selection

In [14]:
df

    Name  Age      City  Salary
0   john   28  new york   65000
1   anna   34     paris   70000
2  peter   29    berlin   62000
3  linda   20    london   85000

In [15]:
df[df['Age'] > 28]

    Name  Age    City  Salary
1   anna   34   paris   70000
2  peter   29  berlin   62000

In [19]:
# people whose age is above 30 and lives in paris
df[(df['Age'] > 30) & (df['City'] == 'paris')]

   Name  Age   City  Salary
1  anna   34  paris   70000